<template>
    <div class="contract">
        <div class="papel">
            <h2>喵剪辑服务协议</h2>
            <div>欢迎使用我们的产品/服务。请在使用我们的产品/服务之前仔细阅读这份用户协议。这份协议针对您使用我们的产品/服务时适用的所有细节。如果您有任何疑问，欢迎与我们联系。</div>
            <h4>服务内容</h4>
            <div>我们的产品/服务包括但不限于在我们的平台上发布、储存、展示、分享、转载和传播内容、评论和交流等功能。我们保留随时修改、暂停、取消或终止部分或全部服务的权利。</div>
            <h4>用户内容</h4>
            <div>您必须承担您在使用我们的产品/服务时提供的所有内容的责任。您不得发布任何不合适、诽谤、淫秽、威胁、色情或暴力的内容。除此之外，您必须尊重他人的知识产权和隐私权，不得发布侵犯他人权益的内容。如果我们收到关于您发布内容侵犯他人权益的投诉，我们将会依照法律法规的要求采取必要措施并通知您。</div>
            <h4>知识产权</h4>
            <div>我们的产品/服务及其所有内容（包括但不限于文本、图像、音频和视频）都受版权、商标、专利和其他知识产权的保护。除非我们明确授权，否则您不得复制、修改、分发或使用我们的产品/服务及其内容。</div>
            <h4>隐私政策</h4>
            <div>我们非常重视您的隐私，并采取适当措施来保护您的个人信息。我们的隐私政策说明了我们收集、使用和保护您的个人信息的做法。请务必仔细阅读我们的隐私政策。</div>
            <h4>免责声明</h4>
            <div>我们的产品/服务按“原样”提供，不提供任何明示或暗示的保证。您使用我们的产品/服务时存在风险和责任，我们不对产品的适用性、可靠性、准确性、无故障或无病毒等做任何担保。您使用我们的产品/服务产生的任何后果由您自行承担。</div>
            <h4>终止</h4>
            <div>我们保留根据我们的裁量权力随时、无原因和不必事先通知您而终止、暂停、删除您的账号和/或限制您使用我们的产品/服务的权利。如果您违反了这些使用条款，我们可能立即终止您的使用权。</div>
            <h4>适用法律</h4>
            <div>这些使用条款受中华人民共和国法律管辖，任何争议应提交至本协议签订地的人民法院管辖。</div>
            <h4>修订</h4>
            <div>我们保留随时修改这些使用条款的权利。如果我们修改了使用条款，我们会在我们的网站上发布更新版本。您应定期查看这些使用条款以了解任何变更。</div>
            <h4>其他规定</h4>
            <div>与我们的产品/服务相关的其他信息、通知、规定、警示应以我们网站上发布的公告为准。</div>
            <h4>其他</h4>
            <div>本协议中的标题仅为方便而设，不具有法律效力。如本协议中任何条款无法执行，该条款将被视为无效，余下条款仍具有法律效力。我们未能执行本协议的任何条款并不构成对该条款的放弃。</div>
            <div>感谢您花时间阅读这份用户协议。如果您有任何问题或疑虑，请随时联系我们。</div>
        </div>
    </div>
</template>

<script lang="ts" setup>
</script>

<style lang="scss" scoped>
    .contract{
        width: 100%;
        flex-direction: row;
        justify-content: center;
        padding: 40px 0px;
        overflow-y: auto;
        background-color: #E9E9E9;
        box-sizing: border-box;
        @media screen and (max-width: 1205px) {
            padding: 0px;
        }
        .papel{
            margin: 0px auto;
            background-color: #fdfdfd;
            padding: 90px 75px;
            width: 1100px;
            box-sizing: border-box;
            >h2{
                display: flex;
                justify-content: center;
            }
            >h4{
                margin-top: 15px;
            }
            >div{
                text-indent: 2em;
            }
            @media screen and (max-width: 1205px) {
                width: 100%;
            }
        }
    }
</style>